#  Numpy

In [3]:
import numpy as np
# Numpy is the linear algebra library for python
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [4]:
np.arange(0,10,3)

array([0, 3, 6, 9])

In [5]:
ch = [1,2,3]

In [6]:
np.array(ch)

array([1, 2, 3])

In [7]:
ch = (1,2,3)

In [8]:
np.array(ch)

array([1, 2, 3])

In [9]:
np.array([4,5,6])

array([4, 5, 6])

In [10]:
ch = np.array([1,2,3])

In [11]:
ch.shape

(3,)

In [12]:
np.ones

In [13]:
np.ones((4,5)) # here pass the dimensions in a tuple.

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [14]:
np.random.rand(5)

array([0.45959318, 0.66419562, 0.45686971, 0.83727337, 0.66310205])

In [15]:
np.random.randn(7)

array([ 1.19294018,  0.15734113, -1.15400272,  0.66547479, -0.4037735 ,
       -0.05156924, -0.27478088])

In [16]:
np.random.randn(3,4)

array([[-0.78599819, -2.09775548, -1.45843181, -0.69740863],
       [-0.42972774, -1.94656791, -1.4472296 ,  0.48685374],
       [-2.3321684 , -0.1946399 ,  1.47969729,  0.2692649 ]])

In [17]:
np.random.randint(3,20, 20)

array([18, 12, 16, 18,  7, 13, 15,  7,  5, 11, 12, 10,  7, 16,  6, 11, 17,
        5, 15,  3])

In [16]:
ch = (1,2,3)
np.array(ch)

array([1, 2, 3])

In [90]:
# arrays can be reshaped
ch = np.random.rand(5,4)

In [91]:
ch.shape

(5, 4)

In [92]:
ch.reshape(20)

array([0.1613845 , 0.99116792, 0.07586843, 0.45771647, 0.81149158,
       0.2913673 , 0.59685703, 0.94704355, 0.9865758 , 0.52825848,
       0.81990964, 0.93346464, 0.84683991, 0.36855555, 0.92070079,
       0.86368559, 0.84291338, 0.46600174, 0.61666437, 0.28781517])

In [93]:
ch.reshape(2,10)

array([[0.1613845 , 0.99116792, 0.07586843, 0.45771647, 0.81149158,
        0.2913673 , 0.59685703, 0.94704355, 0.9865758 , 0.52825848],
       [0.81990964, 0.93346464, 0.84683991, 0.36855555, 0.92070079,
        0.86368559, 0.84291338, 0.46600174, 0.61666437, 0.28781517]])

In [95]:
# MAX AND MIN Values in an array can be found by .max, .min, and index values for max, min can be found by argmax and argmin
print (ch.max())
ch.min()

0.9911679184920594

0.07586842537074623

In [22]:
ch.argmax(1)

array([0, 1, 2, 3, 1], dtype=int64)

In [23]:
ch

array([[0.81155605, 0.69765727, 0.60293075, 0.64793025],
       [0.18873901, 0.34842051, 0.18538817, 0.14534635],
       [0.86703797, 0.43769531, 0.9098282 , 0.09480719],
       [0.44805119, 0.81767943, 0.1097249 , 0.93949039],
       [0.32207727, 0.72398098, 0.477066  , 0.56670225]])

In [24]:
type(ch)

numpy.ndarray

In [25]:
ch.dtype

dtype('float64')

In [26]:
ch

array([[0.81155605, 0.69765727, 0.60293075, 0.64793025],
       [0.18873901, 0.34842051, 0.18538817, 0.14534635],
       [0.86703797, 0.43769531, 0.9098282 , 0.09480719],
       [0.44805119, 0.81767943, 0.1097249 , 0.93949039],
       [0.32207727, 0.72398098, 0.477066  , 0.56670225]])

In [27]:
ch = ch.reshape(20)
ch

array([0.81155605, 0.69765727, 0.60293075, 0.64793025, 0.18873901,
       0.34842051, 0.18538817, 0.14534635, 0.86703797, 0.43769531,
       0.9098282 , 0.09480719, 0.44805119, 0.81767943, 0.1097249 ,
       0.93949039, 0.32207727, 0.72398098, 0.477066  , 0.56670225])

In [28]:
ch[21] = 100

IndexError: index 21 is out of bounds for axis 0 with size 20

In [29]:
ch[19] = 99 # numpy arrays can be mutated.

In [30]:
np.append(ch, [100,200])

array([8.11556055e-01, 6.97657266e-01, 6.02930748e-01, 6.47930248e-01,
       1.88739009e-01, 3.48420515e-01, 1.85388171e-01, 1.45346354e-01,
       8.67037968e-01, 4.37695315e-01, 9.09828204e-01, 9.48071944e-02,
       4.48051194e-01, 8.17679431e-01, 1.09724904e-01, 9.39490389e-01,
       3.22077274e-01, 7.23980976e-01, 4.77065999e-01, 9.90000000e+01,
       1.00000000e+02, 2.00000000e+02])

In [31]:
# ESCAPE TO GO INTO COMMAND MODE, SHIFT AND d d to delete all cells.

In [32]:
ch

array([8.11556055e-01, 6.97657266e-01, 6.02930748e-01, 6.47930248e-01,
       1.88739009e-01, 3.48420515e-01, 1.85388171e-01, 1.45346354e-01,
       8.67037968e-01, 4.37695315e-01, 9.09828204e-01, 9.48071944e-02,
       4.48051194e-01, 8.17679431e-01, 1.09724904e-01, 9.39490389e-01,
       3.22077274e-01, 7.23980976e-01, 4.77065999e-01, 9.90000000e+01])

### indexing 2D arrays

In [149]:
npa = np.random.rand(4,5)

In [150]:
npa

array([[0.9807328 , 0.17975438, 0.49170841, 0.99999403, 0.6148473 ],
       [0.32776019, 0.90013409, 0.11338936, 0.02538701, 0.53145997],
       [0.54895679, 0.48810713, 0.03178859, 0.10152666, 0.96436766],
       [0.41561704, 0.32493873, 0.36091833, 0.30406251, 0.58352103]])

## Indexing and Modifying numpy arrays.

In [153]:
# in Python, we generally use colon, after , in arrays.

In [36]:
npa[0,] # row 0 # similar indexing in R matrices except colon indexing by itself (below cell) will not work in R.
# in R , is sufficient. But in python we need colon as well (which wont work in R)

array([0.21484806, 0.92968784, 0.48873756, 0.11439682, 0.2058983 ])

In [62]:
npa[1,] # row 1

array([0.51654471, 0.41895978, 0.65509796, 0.82923973, 0.52447219])

In [63]:
npa[,1]

SyntaxError: invalid syntax (<ipython-input-63-a1a0f9c24c53>, line 1)

In [64]:
npa[:,1]

array([0.92968784, 0.41895978, 0.77035397, 0.4754289 ])

In [38]:
npa[1,2]

0.655097955616753

In [39]:
npa[1,1:3]

array([0.41895978, 0.65509796])

In [40]:
npa.shape

(4, 5)

In [46]:
npa

array([[0.21484806, 0.92968784, 0.48873756, 0.11439682, 0.2058983 ],
       [0.51654471, 0.41895978, 0.65509796, 0.82923973, 0.52447219],
       [0.74317389, 0.77035397, 0.60944516, 0.78135367, 0.44935314],
       [0.90776889, 0.4754289 , 0.06215495, 0.13831031, 0.30637957]])

In [60]:
npa[1,]

array([0.51654471, 0.41895978, 0.65509796, 0.82923973, 0.52447219])

In [55]:
npa[npa[:,1] > 0.5, 1]

array([0.92968784, 0.77035397])

In [26]:
import numpy as np

In [27]:
npa = np.random.randint(1,11,10)

In [28]:
npa

array([ 1,  2,  3,  6,  6,  2,  5, 10,  5,  8])

In [30]:
np.bincount(npa) # bincount gives count of each value starting from 0 to the largest values.

array([0, 1, 2, 1, 0, 2, 2, 0, 1, 0, 1], dtype=int64)

In [31]:
np.where(npa==10) # gives the index position where value = 10

(array([7], dtype=int64),)

## Algebraic operations

In [78]:
al = [1,2,3,4]

In [79]:
al

[1, 2, 3, 4]

In [80]:
al*4

[1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4]

In [81]:
al + [1,2,3,4]

[1, 2, 3, 4, 1, 2, 3, 4]

In [82]:
al.append(5)

In [83]:
al

[1, 2, 3, 4, 5]

In [84]:
[4*i for i in al]

[4, 8, 12, 16, 20]

In [85]:
# See the power of numpy

In [86]:
npa = np.arange(10)

In [87]:
npa

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [88]:
npa*5

array([ 0,  5, 10, 15, 20, 25, 30, 35, 40, 45])

In [89]:
npa-500

array([-500, -499, -498, -497, -496, -495, -494, -493, -492, -491])

In [90]:
npa/npa

C:\Users\sridhar\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: RuntimeWarning: invalid value encountered in true_divide
  if __name__ == '__main__':

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [93]:
# in R however, we can do algebraic operations on vectors, matrices, data frame directly.

In [94]:
npa

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [95]:
list(npa)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [96]:
tuple(npa)

(0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

In [100]:
s = "hello"

In [101]:
list(s)

['h', 'e', 'l', 'l', 'o']

In [102]:
str(npa)

'[0 1 2 3 4 5 6 7 8 9]'

In [104]:
ch = np.array(str(npa))

In [108]:
npa

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [109]:
list(npa)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [110]:
np.array(list(npa))

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [111]:
np.array(tuple(npa))

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [112]:
tp = ("a", "b", "c", "d")

In [114]:
ch = np.array(tp)

In [118]:
ch

array(['a', 'b', 'c', 'd'], dtype='<U1')

In [119]:
ch[0]

'a'

In [124]:
npa

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [132]:
s = "hello" # no need to convert strings intp np arrays. what is the point

In [162]:
list(s) # list can be used if we want to convert string or split into invidividual characters.

['h', 'e', 'l', 'l', 'o']

## Several math functions for numpy

In [ ]:
# max, min, mean, sum, sqrt, just use np.function universal function
# Go to this link https://docs.scipy.org/doc/numpy/reference/ufuncs.html for more functions.

In [170]:
np.mean(npa)

4.5

In [171]:
np.sqrt(npa)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [2]:
import numpy as np

In [3]:
npa = np.random.randn(4,5)

In [4]:
npa

array([[ 0.38674782,  1.38007636, -1.13661355,  0.30124261,  0.4519898 ],
       [-0.56499318, -0.30596458, -0.02765267, -1.8154658 , -0.1989666 ],
       [-1.63252972,  0.05322354,  0.32812797,  0.38443902,  0.7210034 ],
       [ 0.74090023,  2.30351319, -0.32136476,  0.27103533, -0.43895346]])

In [6]:
np.mean(npa,1)

array([ 0.27668861, -0.58260857, -0.02914716,  0.5110261 ])

# Pandas

## Pandas Series

In [1]:
# Pandas series differ form mumpy arrays in that, we can define labels for the series index

In [4]:
import pandas as pd
import numpy as np
s = pd.Series([1,2,3,4])

In [5]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [70]:
s = pd.Series([1,2,3,4], index = ["a","b","c","d"])

In [71]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [72]:
s2 = pd.Series([5,6,7,8], index = ["a","b","c","d"])

In [73]:
s2

a    5
b    6
c    7
d    8
dtype: int64

In [75]:
s+s2

a     6
b     8
c    10
d    12
dtype: int64

In [76]:
s2.values # gives only the values in numpy array form.

array([5, 6, 7, 8], dtype=int64)

In [15]:
# list, tuple, numpy 1D array and dictionaries can all be converted into pandas series

In [45]:
l = list(range(0,5))
t = tuple(range(10,15))
npa = np.arange(10,35,5)
al1 = [51,27,13,56]
d1 = dict(enumerate(a))
al2 = [("k"+str(i), i) for i in range(0,10)]
d2 = {key:value for key,value in al2}

In [50]:
pd.Series(l)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [53]:
pd.Series(l,index=["a","b","c","d", "e"])

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [47]:
pd.Series(t)

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [48]:
pd.Series(d1)

0    51
1    27
2    13
3    56
dtype: int64

In [49]:
pd.Series(d2)

k0    0
k1    1
k2    2
k3    3
k4    4
k5    5
k6    6
k7    7
k8    8
k9    9
dtype: int64

In [54]:
d3 = {"k1": 2, "k2":[1,2,3], "k3":("a","b"),"k4":{"sk1":5}}

In [55]:
d3

{'k1': 2, 'k2': [1, 2, 3], 'k3': ('a', 'b'), 'k4': {'sk1': 5}}

In [56]:
pd.Series(d3)

k1             2
k2     [1, 2, 3]
k3        (a, b)
k4    {'sk1': 5}
dtype: object

## Pandas DatafRames

In [3]:
import pandas as pd
# rows are indexed 0, columns are 1

In [4]:
# Basically each row or column is a series

In [5]:
# Data frames best created from dictionaries or numpy arrays.



### Init signature: pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

In [6]:
# DataFrames can be created by reading csv files, from a single series object, from dictionary, a dictionary of series objects, 
# from a 2D numpy array, from a list of dictionary objects.

#### df.info() will give a brief info on data frame columns and types. similar to str() in R
#### df.describe() will give brief staistics on all numeric type columns. similar to summary() in R
#### Some python methods have df.(), and others just df.    This is because methods use df.method(), and attributes just df.attribute

In [7]:
pwd

'C:\\Users\\sridhar\\Google Drive\\Data Science\\Python\\ECE-Python\\Intro-Python'

In [8]:
df = pd.read_csv('Wine.csv')

In [9]:
df.head()

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,4,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,5,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 15 columns):
Unnamed: 0         178 non-null int64
Type               178 non-null int64
Alcohol            178 non-null float64
Malic              178 non-null float64
Ash                178 non-null float64
Alcalinity         178 non-null float64
Magnesium          178 non-null int64
Phenols            178 non-null float64
Flavanoids         178 non-null float64
Nonflavanoids      178 non-null float64
Proanthocyanins    178 non-null float64
Color              178 non-null float64
Hue                178 non-null float64
Dilution           178 non-null float64
Proline            178 non-null int64
dtypes: float64(11), int64(4)
memory usage: 20.9 KB

In [11]:
df.describe()

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
count,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000
mean,89.500000,1.938202,13.000618,2.336348,2.366517,19.494944,99.741573,2.295112,2.029270,0.361854,1.590899,5.058090,0.957449,2.611685,746.893258
std,51.528309,0.775035,0.811827,1.117146,0.274344,3.339564,14.282484,0.625851,0.998859,0.124453,0.572359,2.318286,0.228572,0.709990,314.907474
min,1.000000,1.000000,11.030000,0.740000,1.360000,10.600000,70.000000,0.980000,0.340000,0.130000,0.410000,1.280000,0.480000,1.270000,278.000000
25%,45.250000,1.000000,12.362500,1.602500,2.210000,17.200000,88.000000,1.742500,1.205000,0.270000,1.250000,3.220000,0.782500,1.937500,500.500000
50%,89.500000,2.000000,13.050000,1.865000,2.360000,19.500000,98.000000,2.355000,2.135000,0.340000,1.555000,4.690000,0.965000,2.780000,673.500000
75%,133.750000,3.000000,13.677500,3.082500,2.557500,21.500000,107.000000,2.800000,2.875000,0.437500,1.950000,6.200000,1.120000,3.170000,985.000000
max,178.000000,3.000000,14.830000,5.800000,3.230000,30.000000,162.000000,3.880000,5.080000,0.660000,3.580000,13.000000,1.710000,4.000000,1680.000000

In [12]:
df.columns # this is a attribute

Index(['Unnamed: 0', 'Type', 'Alcohol', 'Malic', 'Ash', 'Alcalinity',
       'Magnesium', 'Phenols', 'Flavanoids', 'Nonflavanoids',
       'Proanthocyanins', 'Color', 'Hue', 'Dilution', 'Proline'],
      dtype='object')

In [13]:
df.shape # attribute

(178, 15)

In [14]:
df.mean() # method. For method it does some kind of action. # attributes just state some info on the data frame.

Unnamed: 0          89.500000
Type                 1.938202
Alcohol             13.000618
Malic                2.336348
Ash                  2.366517
Alcalinity          19.494944
Magnesium           99.741573
Phenols              2.295112
Flavanoids           2.029270
Nonflavanoids        0.361854
Proanthocyanins      1.590899
Color                5.058090
Hue                  0.957449
Dilution             2.611685
Proline            746.893258
dtype: float64

In [21]:
df['Alcohol'].max()

14.83

In [25]:
df.index[df['Alcohol']==14.83] # index where value = 14.83

Int64Index([8], dtype='int64')

In [110]:
df['Alcohol'].idxmax()# this gives the index where id is max, similar to which.max() in R

8

In [230]:
# From a 2d numpy array

In [8]:
df = pd.DataFrame(np.random.randn(4,5))

In [9]:
df

          0         1         2         3         4
0  0.589008 -0.752536 -0.210306  0.927043 -0.038810
1  0.465919  1.069543 -0.755772  1.332303  0.126986
2  0.168493 -1.259497  0.263725  0.203634  1.814273
3  0.091623  1.006079 -1.841253  0.482241 -0.028039

In [10]:
df = pd.DataFrame(np.random.randn(4,5), index=["r0", "r1", "r2", "r3"], columns = ["c1", "c2", "c3", "c4", "c5"])

In [11]:
df

          c1        c2        c3        c4        c5
r0 -0.581382 -0.631437 -1.083820 -0.824090  1.978655
r1  1.078916 -0.386725 -0.096208  0.324096 -1.049378
r2  0.113787 -1.560847  0.972500  0.481824 -0.063005
r3  0.285393 -0.022709 -1.084410 -0.900464  0.652875

In [12]:
# from a dictionary

In [13]:
d = {"k1":1, "k2":2, "k3":3}

In [14]:
df =pd.DataFrame(data=d, index=[0,1,2]) # if scalar values are given, then must specify an index

In [15]:
df

   k1  k2  k3
0   1   2   3
1   1   2   3
2   1   2   3

In [16]:
df = pd.DataFrame({"k1":[1,2,3], "k2":["a","b","c"]}) # no need to specify index.

In [17]:
df

   k1 k2
0   1  a
1   2  b
2   3  c

In [18]:
# from a dictionary of series objects

In [19]:
s1 = pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [20]:
s2 = pd.Series(["a","b","c"])
s2

0    a
1    b
2    c
dtype: object

In [21]:
pd.DataFrame({'s1':s1, 's2':s2})

   s1 s2
0   1  a
1   2  b
2   3  c

In [22]:
pd.DataFrame(s1) # from a single series object.

   0
0  1
1  2
2  3

In [23]:
# from lists directly

In [24]:
df = pd.DataFrame([[1,2,3,4]]) # we need to pass a list of lists

In [25]:
df

   0  1  2  3
0  1  2  3  4

In [26]:
df = pd.DataFrame([[1,2,3,4],["a","b","c","d"]], index='r1,r2'.split(","), columns='c1,c2,c3,c4'.split(","))

In [27]:
df

   c1 c2 c3 c4
r1  1  2  3  4
r2  a  b  c  d

In [28]:
# Modiyinf data frames

In [29]:
df = pd.DataFrame(np.random.randn(3,4), index=['r1', 'r2', 'r3'], columns=['c1','c2','c3','c4'])

In [30]:
df

          c1        c2        c3        c4
r1 -1.807483 -1.133142 -0.946658  1.026452
r2  0.882857  0.396357 -0.688555 -1.504458
r3  0.104798 -0.660211  1.429795 -0.773330

In [31]:
# two general methods to indexing. If names are available, use them directly for columns

In [32]:
df["c1"]

r1   -1.807483
r2    0.882857
r3    0.104798
Name: c1, dtype: float64

In [33]:
# for multiple columnsc

In [34]:
df[["c1","c4"]] # pass a list of columns.  Here in R we use c("c1","c4")

          c1        c4
r1 -1.807483  1.026452
r2  0.882857 -1.504458
r3  0.104798 -0.773330

In [35]:
df.loc["r1"] # for rows, instead use .loc["row name"]

c1   -1.807483
c2   -1.133142
c3   -0.946658
c4    1.026452
Name: r1, dtype: float64

In [36]:
df.iloc[2] # for rows using the index value use .iloc[index value]

c1    0.104798
c2   -0.660211
c3    1.429795
c4   -0.773330
Name: r3, dtype: float64

In [37]:
df["c5"] = [4,5,6]

In [38]:
df

          c1        c2        c3        c4  c5
r1 -1.807483 -1.133142 -0.946658  1.026452   4
r2  0.882857  0.396357 -0.688555 -1.504458   5
r3  0.104798 -0.660211  1.429795 -0.773330   6

In [39]:
df.iloc[0,:] # 0 row and all columns

c1   -1.807483
c2   -1.133142
c3   -0.946658
c4    1.026452
c5    4.000000
Name: r1, dtype: float64

In [40]:
df.iloc[0, 1:3] # 0 row and columns 1, 2

c2   -1.133142
c3   -0.946658
Name: r1, dtype: float64

In [41]:
 df.loc[["r1","r2"],["c1","c3"]] # when selecting multiple columns or rows, pass as a list. Also use loc for indexing with names

          c1        c3
r1 -1.807483 -0.946658
r2  0.882857 -0.688555

In [42]:
df.loc[:,"c1"]

r1   -1.807483
r2    0.882857
r3    0.104798
Name: c1, dtype: float64

In [43]:
df

          c1        c2        c3        c4  c5
r1 -1.807483 -1.133142 -0.946658  1.026452   4
r2  0.882857  0.396357 -0.688555 -1.504458   5
r3  0.104798 -0.660211  1.429795 -0.773330   6

In [44]:

df2 = pd.DataFrame([[1,2,3,4,5]], columns = 'c1 c2 c3 c4 c5'.split())

In [45]:
df2

   c1  c2  c3  c4  c5
0   1   2   3   4   5

In [46]:
df.append(df2)

          c1        c2        c3        c4  c5
r1 -1.807483 -1.133142 -0.946658  1.026452   4
r2  0.882857  0.396357 -0.688555 -1.504458   5
r3  0.104798 -0.660211  1.429795 -0.773330   6
0   1.000000  2.000000  3.000000  4.000000   5

In [47]:
df

          c1        c2        c3        c4  c5
r1 -1.807483 -1.133142 -0.946658  1.026452   4
r2  0.882857  0.396357 -0.688555 -1.504458   5
r3  0.104798 -0.660211  1.429795 -0.773330   6

In [48]:
df["c1"] > 0

r1    False
r2     True
r3     True
Name: c1, dtype: bool

In [49]:
df.loc[df["c1"] > 0,["c3","c5"]] # always remember to use .loc for rows when using names or booleans

          c3  c5
r2 -0.688555   5
r3  1.429795   6

In [50]:
#.ix allows a hybrid approach to indexing (hybrid between loc and iloc)

In [51]:
df.ix[0:3, ["c1","c2"]]

C:\Users\sridhar\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

          c1        c2
r1 -1.807483 -1.133142
r2  0.882857  0.396357
r3  0.104798 -0.660211

In [52]:
df.ix[df["c1"]>0, 1]

r2    0.396357
r3   -0.660211
Name: c2, dtype: float64

In [53]:
df.loc["r1"] >0

c1    False
c2    False
c3    False
c4     True
c5     True
Name: r1, dtype: bool

In [54]:
# when using multiple conditions, do not use AND instead use & or |
df[(df["c1"]>0) & (df["c3"] >0)] # because and will work for between two series of boolean values instead of just two booleans
# in R we use & anyway and it doesnt matter.

          c1        c2        c3       c4  c5
r3  0.104798 -0.660211  1.429795 -0.77333   6

In [55]:
df.loc[(df["c1"]>0) & (df["c3"] >0), ["c1","c5"]] # if we want to use booleans in the row, use .loc

          c1  c5
r3  0.104798   6

In [56]:
df

          c1        c2        c3        c4  c5
r1 -1.807483 -1.133142 -0.946658  1.026452   4
r2  0.882857  0.396357 -0.688555 -1.504458   5
r3  0.104798 -0.660211  1.429795 -0.773330   6

In [57]:
df.pop("c5") # returns the popped column and mutates the original df

r1    4
r2    5
r3    6
Name: c5, dtype: int64

In [58]:
df.

SyntaxError: invalid syntax (<ipython-input-58-d230d845cd15>, line 1)

In [59]:
df["c5"] = [4,5,6]

In [60]:
df.drop("c5",1) # to remove a column. 1 is for columns. Similarly we can delete rows as well.

          c1        c2        c3        c4
r1 -1.807483 -1.133142 -0.946658  1.026452
r2  0.882857  0.396357 -0.688555 -1.504458
r3  0.104798 -0.660211  1.429795 -0.773330

In [61]:
df["c5"] = [4,5,6]

### reset index

In [62]:
df.reset_index()

  index        c1        c2        c3        c4  c5
0    r1 -1.807483 -1.133142 -0.946658  1.026452   4
1    r2  0.882857  0.396357 -0.688555 -1.504458   5
2    r3  0.104798 -0.660211  1.429795 -0.773330   6

In [63]:
df.set_index("c5", inplace=True) # to set a differnet column as index. if inplace=False, original df unchanged

In [66]:
df

          c1        c2        c3        c4
c5
4  -1.807483 -1.133142 -0.946658  1.026452
5   0.882857  0.396357 -0.688555 -1.504458
6   0.104798 -0.660211  1.429795 -0.773330

In [68]:
df.index= ['a', 'b', 'c'] # to give a new index

In [69]:
df

         c1        c2        c3        c4
a -1.807483 -1.133142 -0.946658  1.026452
b  0.882857  0.396357 -0.688555 -1.504458
c  0.104798 -0.660211  1.429795 -0.773330

In [65]:
list(df.columns) # to get the column names (in R this was colnames(df))

['c1', 'c2', 'c3', 'c4']

In [417]:
list(df.index)

[4, 5, 6]

In [1]:
l1 = [1,2,3]
l2 = ["a","b","c"]
list(zip(l1,l2)) # zip iterates on each iterable and creates a tuple

[(1, 'a'), (2, 'b'), (3, 'c')]

In [2]:
dict(zip(l1,l2))

{1: 'a', 2: 'b', 3: 'c'}

## multilevel indexing

In [420]:
# it is important and advanced. we will get to it later.

# Missing Values

In [428]:
d = {"k1": [1,2,3, 7], "k2": [4,np.nan, 5, 8], "k3":[np.nan, np.nan, 9, 12], "k4":[3,6,9, 11]}

In [429]:
df = pd.DataFrame(d)

In [430]:
df

   k1   k2    k3  k4
0   1  4.0   NaN   3
1   2  NaN   NaN   6
2   3  5.0   9.0   9
3   7  8.0  12.0  11

In [431]:
df.dropna()

   k1   k2    k3  k4
2   3  5.0   9.0   9
3   7  8.0  12.0  11

In [432]:
df.dropna(axis=1)

   k1  k4
0   1   3
1   2   6
2   3   9
3   7  11

In [442]:
df.fillna(0)

   k1   k2    k3  k4
0   1  4.0   0.0   3
1   2  0.0   0.0   6
2   3  5.0   9.0   9
3   7  8.0  12.0  11

In [443]:
df.fillna(df.mean(),axis=0) # fill na with mean values in each column. IN R BETTER TO USE HMISC, MICE PACKAGES.

   k1        k2    k3  k4
0   1  4.000000  10.5   3
1   2  5.666667  10.5   6
2   3  5.000000   9.0   9
3   7  8.000000  12.0  11

In [16]:
from string import ascii_lowercase
import numpy as np
import pandas as pd

In [17]:
ascii_lowercase

'abcdefghijklmnopqrstuvwxyz'

## Groupby

In [18]:
# something similar to lapply, sapply, tapply in R. where we group rows by some column and perform an aggregate function on group

In [33]:
d = {"Item":["chair", "desk", "rug", "table", "chair", "couch", "couch", "chair", "rug", "desk"], 
     "Agent":["sally", "bob", "sally", "amy", "bob", "amy", "sally", "bob", "amy", "sally"],
      "salep": [100, 110, 200, 100, 150, 800, 1000, 100, 85, 110]}

In [34]:
df = pd.DataFrame(d)

In [35]:
df

   Agent   Item  salep
0  sally  chair    100
1    bob   desk    110
2  sally    rug    200
3    amy  table    100
4    bob  chair    150
5    amy  couch    800
6  sally  couch   1000
7    bob  chair    100
8    amy    rug     85
9  sally   desk    110

In [36]:
df.groupby("Item").mean() # only salep is returned because its numeric and agent is not.

            salep
Item
chair  116.666667
couch  900.000000
desk   110.000000
rug    142.500000
table  100.000000

In [37]:
df.groupby("Agent")["salep"].mean() # we can also specify the columns on which we want the mean.

Agent
amy      328.333333
bob      120.000000
sally    352.500000
Name: salep, dtype: float64

In [38]:
df.groupby("Agent")["salep"].count()

Agent
amy      3
bob      3
sally    4
Name: salep, dtype: int64

## Merging dataframes

In [40]:
# commands to merge dataframes are concant and merge
# use merge if we just want to add dataframes by rows or columns as long as all the index and column names are same

In [42]:
df1 = pd.DataFrame(np.random.randn(3,4), index = 'r0 r1 r2'.split(), columns = 'co c1 c2 c3'.split())

In [43]:
df1

          co        c1        c2        c3
r0 -1.037857  0.908149 -1.037233 -0.316345
r1  0.413403 -1.627548  0.760591 -2.076801
r2  0.379228 -0.964468 -0.884444  0.206144

In [45]:
df2 = pd.DataFrame(np.random.randn(3,4), index = 'r0 r1 r2'.split(), columns = 'c4 c5 c6 c7'.split())

In [46]:
df2 # same row indexes, but differnt column names. We can use concat to join data frames together bycolumn

          c4        c5        c6        c7
r0 -1.703675  0.631855  1.320687 -1.657205
r1 -1.028683 -0.717891  0.103742 -1.978568
r2  0.197764 -1.369439  2.014703 -0.811467

In [49]:
pd.concat([df1,df2], axis=1) # axis = 1 for column, default is 0

,co,c1,c2,c3,c4,c5,c6,c7
r0,-1.037857,0.908149,-1.037233,-0.316345,-1.703675,0.631855,1.320687,-1.657205
r1,0.413403,-1.627548,0.760591,-2.076801,-1.028683,-0.717891,0.103742,-1.978568
r2,0.379228,-0.964468,-0.884444,0.206144,0.197764,-1.369439,2.014703,-0.811467

In [51]:
pd.concat([df1,df2], axis=0) # we get NaN because to join by rows, the column names are different.

,c1,c2,c3,c4,c5,c6,c7,co
r0,0.908149,-1.037233,-0.316345,NaN,NaN,NaN,NaN,-1.037857
r1,-1.627548,0.760591,-2.076801,NaN,NaN,NaN,NaN,0.413403
r2,-0.964468,-0.884444,0.206144,NaN,NaN,NaN,NaN,0.379228
r0,NaN,NaN,NaN,-1.703675,0.631855,1.320687,-1.657205,NaN
r1,NaN,NaN,NaN,-1.028683,-0.717891,0.103742,-1.978568,NaN
r2,NaN,NaN,NaN,0.197764,-1.369439,2.014703,-0.811467,NaN

In [59]:
# if we want to merge by some common column, then we use merge

In [60]:
df1

          co        c1        c2        c3
r0 -1.037857  0.908149 -1.037233 -0.316345
r1  0.413403 -1.627548  0.760591 -2.076801
r2  0.379228 -0.964468 -0.884444  0.206144

In [61]:
df2

          c4        c5        c6        c7
r0 -1.703675  0.631855  1.320687 -1.657205
r1 -1.028683 -0.717891  0.103742 -1.978568
r2  0.197764 -1.369439  2.014703 -0.811467

In [ ]:
# there are no common columns to merge on, but if we do it anyway as shown below, we will not get anything back

In [63]:
pd.merge(df1,df2,how='inner', left_on = 'c1', right_on='c4') # because there are no common columns, error.
# left_on and right_on are used, when the column values might represent the same thing, but just the column names are different.

Empty DataFrame
Columns: [co, c1, c2, c3, c4, c5, c6, c7]
Index: []

In [64]:
pd.merge(df1,df2,how='left',left_on = 'c1', right_on='c4') # this is a left merge. All left data frames are returned, right df2
# columns are simply added with NaN values. No common columns anyway.

         co        c1        c2        c3  c4  c5  c6  c7
0 -1.037857  0.908149 -1.037233 -0.316345 NaN NaN NaN NaN
1  0.413403 -1.627548  0.760591 -2.076801 NaN NaN NaN NaN
2  0.379228 -0.964468 -0.884444  0.206144 NaN NaN NaN NaN

In [65]:
# similarly there are right, and full outer join. which will return all df1 rows, and all df2 rows. Any non matching values will 
# be NaN

In [66]:
pd.merge(df1,df2,how='outer',left_on = 'c1', right_on='c4')

,co,c1,c2,c3,c4,c5,c6,c7
0,-1.037857,0.908149,-1.037233,-0.316345,NaN,NaN,NaN,NaN
1,0.413403,-1.627548,0.760591,-2.076801,NaN,NaN,NaN,NaN
2,0.379228,-0.964468,-0.884444,0.206144,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,-1.703675,0.631855,1.320687,-1.657205
4,NaN,NaN,NaN,NaN,-1.028683,-0.717891,0.103742,-1.978568
5,NaN,NaN,NaN,NaN,0.197764,-1.369439,2.014703,-0.811467

### we can also join the dataframes by matching on index values. 
### we use df1.join(df2) for that.

## Some important methods

In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame(np.random.rand(4,5), index= 'r0 r1 r2 r3'.split(), columns='c0 c1 c2 c3 c4'.split())

In [6]:
df

          c0        c1        c2        c3        c4
r0  0.559593  0.370294  0.111880  0.779248  0.633542
r1  0.141408  0.205284  0.647226  0.784056  0.504624
r2  0.383341  0.104656  0.468537  0.520382  0.571355
r3  0.795961  0.466227  0.764240  0.662658  0.200032

In [7]:
df['c1'] > 0.3

r0     True
r1    False
r2    False
r3     True
Name: c1, dtype: bool

In [14]:
df.loc[df['c1']>0.3,]

          c0        c1       c2        c3        c4
r0  0.559593  0.370294  0.11188  0.779248  0.633542
r3  0.795961  0.466227  0.76424  0.662658  0.200032

In [15]:
df.ix[df['c2'] <0.2,]

C:\Users\sridhar\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

          c0        c1       c2        c3        c4
r0  0.559593  0.370294  0.11188  0.779248  0.633542

In [18]:
df['c1'].mean()

0.28661522324013045

In [21]:
df.apply(sum, 0)  # apply can be used to apply a function across all columns or rows. similart o apply() in R.

c0    1.880303
c1    1.146461
c2    1.991883
c3    2.746344
c4    1.909553
dtype: float64

In [32]:
df.apply(np.mean, 1)

r0    0.490912
r1    0.456520
r2    0.409654
r3    0.577824
dtype: float64

In [ ]:
# functions to pass to apply can also be user defined functions.

In [26]:
df['c1'].unique() # all the elements are uniue in this

array([0.37029392, 0.20528401, 0.10465592, 0.46622704])

In [28]:
df['c1'].nunique()

4

In [33]:
df['c1'].value_counts() # number of values for each unique values in R we simply use table(df['c1]) to get unique values

0.466227    1
0.104656    1
0.205284    1
0.370294    1
Name: c1, dtype: int64

### deleting or dropping columns

In [49]:
df

          c1        c2        c3        c4
r0  0.370294  0.111880  0.779248  0.633542
r1  0.205284  0.647226  0.784056  0.504624
r2  0.104656  0.468537  0.520382  0.571355
r3  0.466227  0.764240  0.662658  0.200032

In [51]:
df.drop('c1',1) # in R df['c0] = NULL 
# remember, this does not mutate the origil df. inplace=True will take care of that

          c2        c3        c4
r0  0.111880  0.779248  0.633542
r1  0.647226  0.784056  0.504624
r2  0.468537  0.520382  0.571355
r3  0.764240  0.662658  0.200032

In [52]:
df

          c1        c2        c3        c4
r0  0.370294  0.111880  0.779248  0.633542
r1  0.205284  0.647226  0.784056  0.504624
r2  0.104656  0.468537  0.520382  0.571355
r3  0.466227  0.764240  0.662658  0.200032

In [53]:
df.drop('r0',0) # we can also delete rows

          c1        c2        c3        c4
r1  0.205284  0.647226  0.784056  0.504624
r2  0.104656  0.468537  0.520382  0.571355
r3  0.466227  0.764240  0.662658  0.200032

In [54]:
# another delete method is to use del function

In [55]:
del df['c1']

In [56]:
df

          c2        c3        c4
r0  0.111880  0.779248  0.633542
r1  0.647226  0.784056  0.504624
r2  0.468537  0.520382  0.571355
r3  0.764240  0.662658  0.200032

In [57]:
npa = np.random.rand(4,5)

In [58]:
npa

array([[0.48776618, 0.15425156, 0.33342979, 0.17013809, 0.87705742],
       [0.91458224, 0.34088094, 0.32272415, 0.42838838, 0.03662541],
       [0.47008211, 0.21498352, 0.63847015, 0.67712505, 0.35748363],
       [0.15016948, 0.36995678, 0.52115732, 0.16370203, 0.98617901]])

In [59]:
npa.drop(0,1) # no drop method for numpy object.

AttributeError: 'numpy.ndarray' object has no attribute 'drop'

In [60]:
np.delete(npa, 0, 1) # delete column 0.

array([[0.15425156, 0.33342979, 0.17013809, 0.87705742],
       [0.34088094, 0.32272415, 0.42838838, 0.03662541],
       [0.21498352, 0.63847015, 0.67712505, 0.35748363],
       [0.36995678, 0.52115732, 0.16370203, 0.98617901]])

In [61]:
### sorting

In [62]:
df

          c2        c3        c4
r0  0.111880  0.779248  0.633542
r1  0.647226  0.784056  0.504624
r2  0.468537  0.520382  0.571355
r3  0.764240  0.662658  0.200032

In [64]:
df.sort_values('c2',0) # In R we can use the order() which gives sorted indices, which can then be used in df[order(),]

          c2        c3        c4
r0  0.111880  0.779248  0.633542
r2  0.468537  0.520382  0.571355
r1  0.647226  0.784056  0.504624
r3  0.764240  0.662658  0.200032

## reading and writing

In [65]:
# typically pd.read_ will give many options to read and df.to_ many options to write
# pd.read_csv, pd.read_excel, df.to_csv etc..

In [ ]:
#